#include "emulator/library.h"
#include "emulator/ai.h"
#include "emulator/cpu.h"
#include "emulator/flash.h"
#include "emulator/frame.h"
#include "emulator/library_jumptables.h"
#include "emulator/pi.h"
#include "emulator/ram.h"
#include "emulator/rom.h"
#include "emulator/rsp.h"
#include "emulator/si.h"
#include "emulator/soundRVL.h"
#include "emulator/system.h"
#include "emulator/vc64_RVL.h"
#include "emulator/vi.h"
#include "emulator/xlHeap.h"
#include "emulator/xlPostRVL.h"
#include "macros.h"
#include "math.h"
#include "string.h"
#include "versions.h"

static bool send_mesg(Cpu* pCPU);
static bool __osEnqueueThread(Cpu* pCPU);
static bool __osDispatchThread(Cpu* pCPU);

typedef union __OSfp_s {
    struct {
        /* 0x0 */ f32 f_odd;
        /* 0x4 */ f32 f_even;
    } f;
    f64 d;
    s64 u64;
} __OSfp_s;

typedef struct __OSThreadContext_s {
    /* 0x000 */ u64 at;
    /* 0x008 */ u64 v0;
    /* 0x010 */ u64 v1;
    /* 0x018 */ u64 a0;
    /* 0x020 */ u64 a1;
    /* 0x028 */ u64 a2;
    /* 0x030 */ u64 a3;
    /* 0x038 */ u64 t0;
    /* 0x040 */ u64 t1;
    /* 0x048 */ u64 t2;
    /* 0x050 */ u64 t3;
    /* 0x058 */ u64 t4;
    /* 0x060 */ u64 t5;
    /* 0x068 */ u64 t6;
    /* 0x070 */ u64 t7;
    /* 0x078 */ u64 s0;
    /* 0x080 */ u64 s1;
    /* 0x088 */ u64 s2;
    /* 0x090 */ u64 s3;
    /* 0x098 */ u64 s4;
    /* 0x0A0 */ u64 s5;
    /* 0x0A8 */ u64 s6;
    /* 0x0B0 */ u64 s7;
    /* 0x0B8 */ u64 t8;
    /* 0x0C0 */ u64 t9;
    /* 0x0C8 */ u64 gp;
    /* 0x0D0 */ u64 sp;
    /* 0x0D8 */ u64 s8;
    /* 0x0E0 */ u64 ra;
    /* 0x0E8 */ u64 lo;
    /* 0x0F0 */ u64 hi;
    /* 0x0F8 */ u32 sr;
    /* 0x0FC */ u32 pc;
    /* 0x100 */ u32 cause;
    /* 0x104 */ u32 badvaddr;
    /* 0x108 */ u32 rcp;
    /* 0x10C */ u32 fpcsr;
    /* 0x110 */ __OSfp_s fp0;
    /* 0x118 */ __OSfp_s fp2;
    /* 0x120 */ __OSfp_s fp4;
    /* 0x128 */ __OSfp_s fp6;
    /* 0x130 */ __OSfp_s fp8;
    /* 0x138 */ __OSfp_s fp10;
    /* 0x140 */ __OSfp_s fp12;
    /* 0x148 */ __OSfp_s fp14;
    /* 0x150 */ __OSfp_s fp16;
    /* 0x158 */ __OSfp_s fp18;
    /* 0x160 */ __OSfp_s fp20;
    /* 0x168 */ __OSfp_s fp22;
    /* 0x170 */ __OSfp_s fp24;
    /* 0x178 */ __OSfp_s fp26;
    /* 0x180 */ __OSfp_s fp28;
    /* 0x188 */ __OSfp_s fp30;
} __OSThreadContext_s; // size = 0x190

typedef struct __OSThread_s __OSThread_s;

struct __OSThread_s {
    /* 0x00 */ __OSThread_s* next;
    /* 0x04 */ s32 priority;
    /* 0x08 */ __OSThread_s** queue;
    /* 0x0C */ __OSThread_s* tlnext;
    /* 0x10 */ u16 state;
    /* 0x12 */ u16 flags;
    /* 0x14 */ s32 id;
    /* 0x18 */ s32 fp;
    /* 0x20 */ __OSThreadContext_s context;
}; // size = 0x1B0

typedef struct OSMesgQueue_s {
    /* 0x00 */ __OSThread_s* mtqueue;
    /* 0x04 */ __OSThread_s* fullqueue;
    /* 0x08 */ s32 validCount;
    /* 0x0C */ s32 first;
    /* 0x10 */ s32 msgCount;
    /* 0x14 */ void* msg;
} OSMesgQueue_s; // size = 0x18

typedef struct OSIoMesgHdr_s {
    /* 0x0 */ u16 type;
    /* 0x2 */ u8 pri;
    /* 0x3 */ u8 status;
    /* 0x4 */ OSMesgQueue_s* retQueue;
} OSIoMesgHdr_s; // size = 0x8

typedef struct OSIoMesg_s {
    /* 0x00 */ OSIoMesgHdr_s hdr;
    /* 0x08 */ void* dramAddr;
    /* 0x0C */ u32 devAddr;
    /* 0x10 */ u32 size;
    /* 0x14 */ void* piHandle;
} OSIoMesg_s; // size = 0x18

static bool __osException(Cpu* pCPU) {
    s32 iBit;
    Library* pLibrary;
    s64 nData64;
    s64 nCause;
    __OSThread_s* __osRunningThread;
    CpuDevice** apDevice;
    u8* aiDevice;
    u32 nStatus;
    u32 nStatusRSP;
    u32 nData32;
    u32 __OSGlobalIntMask;
    u32 nS0;
    u32 nS1;
    u32 nMask;

    apDevice = pCPU->apDevice;
    aiDevice = pCPU->aiDevice;
    pLibrary = SYSTEM_LIBRARY(gpSystem);

    nData32 = *(u32*)pLibrary->apData[3];
    __OSGlobalIntMask = nData32;

    if (!cpuGetRegisterCP0(pCPU, 12, &nData64)) {
        return false;
    }
    nStatus = nData64;
    if (!cpuSetRegisterCP0(pCPU, 12, nData64 & ~3)) {
        return false;
    }

    CPU_DEVICE_GET32(apDevice, aiDevice, pLibrary->anAddress[8], &pCPU->aGPR[26].u32);
    if (!cpuGetAddressBuffer(pCPU, (void**)&__osRunningThread, pCPU->aGPR[26].u32)) {
        return false;
    }

    __osRunningThread->context.at = pCPU->aGPR[1].u64;
    __osRunningThread->context.sr = nStatus;
    __osRunningThread->context.t0 = pCPU->aGPR[8].u64;
    __osRunningThread->context.t1 = pCPU->aGPR[9].u64;
    __osRunningThread->context.t2 = pCPU->aGPR[10].u64;
    __osRunningThread->context.v0 = pCPU->aGPR[2].u64;
    __osRunningThread->context.v1 = pCPU->aGPR[3].u64;
    __osRunningThread->context.a0 = pCPU->aGPR[4].u64;
    __osRunningThread->context.a1 = pCPU->aGPR[5].u64;
    __osRunningThread->context.a2 = pCPU->aGPR[6].u64;
    __osRunningThread->context.a3 = pCPU->aGPR[7].u64;
    __osRunningThread->context.t3 = pCPU->aGPR[11].u64;
    __osRunningThread->context.t4 = pCPU->aGPR[12].u64;
    __osRunningThread->context.t5 = pCPU->aGPR[13].u64;
    __osRunningThread->context.t6 = pCPU->aGPR[14].u64;
    __osRunningThread->context.t7 = pCPU->aGPR[15].u64;
    __osRunningThread->context.s0 = pCPU->aGPR[16].u64;
    __osRunningThread->context.s1 = pCPU->aGPR[17].u64;
    __osRunningThread->context.s2 = pCPU->aGPR[18].u64;
    __osRunningThread->context.s3 = pCPU->aGPR[19].u64;
    __osRunningThread->context.s4 = pCPU->aGPR[20].u64;
    __osRunningThread->context.s5 = pCPU->aGPR[21].u64;
    __osRunningThread->context.s6 = pCPU->aGPR[22].u64;
    __osRunningThread->context.s7 = pCPU->aGPR[23].u64;
    __osRunningThread->context.t8 = pCPU->aGPR[24].u64;
    __osRunningThread->context.t9 = pCPU->aGPR[25].u64;
    __osRunningThread->context.gp = pCPU->aGPR[28].u64;
    __osRunningThread->context.sp = pCPU->aGPR[29].u64;
    __osRunningThread->context.s8 = pCPU->aGPR[30].u64;
    __osRunningThread->context.ra = pCPU->aGPR[31].u64;
    __osRunningThread->context.lo = pCPU->nLo;
    __osRunningThread->context.hi = pCPU->nHi;

    if (nStatus & 0xFF00) {
        nData32 = ~__OSGlobalIntMask;
        nData32 &= 0xFF00;
        nData32 |= nStatus & 0xFF00;
        nData32 |= nStatus & 0xFFFF00FF;
        __osRunningThread->context.sr = nData32;

        nStatus &= (__OSGlobalIntMask & 0xFF00) | 0xFFFF00FF;
    }

    if (!miGet32(SYSTEM_MI(gpSystem), 0xA430000C, (s32*)&nMask)) {
        return false;
    }

    if (nMask != 0) {
        nData32 = __OSGlobalIntMask;
        nData32 >>= 16;
        nData32 = ~nData32;
        nData32 &= 0x3F;
        nData32 &= __osRunningThread->context.rcp;
        nMask |= nData32;
    }
    __osRunningThread->context.rcp = nMask;

    nData32 = pCPU->anCP0[14];
    __osRunningThread->context.pc = nData32;

    __osRunningThread->context.fpcsr = pCPU->anFCR[31];
    __osRunningThread->context.fp0.u64 = pCPU->aFPR[0].u64;
    __osRunningThread->context.fp2.u64 = pCPU->aFPR[2].u64;
    __osRunningThread->context.fp4.u64 = pCPU->aFPR[4].u64;
    __osRunningThread->context.fp6.u64 = pCPU->aFPR[6].u64;
    __osRunningThread->context.fp8.u64 = pCPU->aFPR[8].u64;
    __osRunningThread->context.fp10.u64 = pCPU->aFPR[10].u64;
    __osRunningThread->context.fp12.u64 = pCPU->aFPR[12].u64;
    __osRunningThread->context.fp14.u64 = pCPU->aFPR[14].u64;
    __osRunningThread->context.fp16.u64 = pCPU->aFPR[16].u64;
    __osRunningThread->context.fp18.u64 = pCPU->aFPR[18].u64;
    __osRunningThread->context.fp20.u64 = pCPU->aFPR[20].u64;
    __osRunningThread->context.fp22.u64 = pCPU->aFPR[22].u64;
    __osRunningThread->context.fp24.u64 = pCPU->aFPR[24].u64;
    __osRunningThread->context.fp26.u64 = pCPU->aFPR[26].u64;
    __osRunningThread->context.fp28.u64 = pCPU->aFPR[28].u64;
    __osRunningThread->context.fp30.u64 = pCPU->aFPR[30].u64;

    if (!cpuGetRegisterCP0(pCPU, 13, &nCause)) {
        return false;
    }

    nData32 = nCause;
    __osRunningThread->context.cause = nData32;

    __osRunningThread->state = 2;
    switch ((nCause & 0x7C) >> 2) {
        case CEC_INTERRUPT:
            nS0 = nStatus & nCause;
            while (true) {
                iBit = 0;
                if (nS0 & 0x100) {
                    iBit = 1;
                }
                if (nS0 & 0x200) {
                    iBit = 2;
                }
                if (nS0 & 0x400) {
                    iBit = 3;
                }
                if (nS0 & 0x800) {
                    iBit = 4;
                }
                if (nS0 & 0x1000) {
                    iBit = 5;
                }
                if (nS0 & 0x2000) {
                    iBit = 6;
                }
                if (nS0 & 0x4000) {
                    iBit = 7;
                }
                if (nS0 & 0x8000) {
                    iBit = 8;
                }
                switch (iBit) {
                    case 1:
                        nCause &= ~0x100;
                        if (!cpuSetRegisterCP0(pCPU, 13, nCause)) {
                            return false;
                        }
                        pCPU->aGPR[4].u32 = 0;
                        send_mesg(pCPU);
                        nS0 &= ~0x100;
                        break;
                    case 2:
                        nCause &= ~0x200;
                        if (!cpuSetRegisterCP0(pCPU, 13, nCause)) {
                            return false;
                        }
                        pCPU->aGPR[4].u32 = 8;
                        send_mesg(pCPU);
                        nS0 &= ~0x200;
                        break;
                    case 3:
                        if (!miGet32(SYSTEM_MI(gpSystem), 0xA4300008, (s32*)&nData32)) {
                            return false;
                        }

                        nS1 = (__OSGlobalIntMask >> 16) & nData32;

                        if (nS1 & 1) {
                            nS1 &= 0x3E;
                            if (!rspGet32(SYSTEM_RSP(gpSystem), 0x04040010, (s32*)&nStatusRSP)) {
                                return false;
                            }
                            nData32 = 0x8008;
                            if (!rspPut32(SYSTEM_RSP(gpSystem), 0x04040010, (s32*)&nData32)) {
                                return false;
                            }
                            if (nStatusRSP & 0x300) {
                                pCPU->aGPR[4].u32 = 0x20;
                                send_mesg(pCPU);
                            } else {
                                pCPU->aGPR[4].u32 = 0x58;
                                send_mesg(pCPU);
                            }
                        }

                        if (nS1 & 8) {
                            nData32 = 0;
                            nS1 &= 0x37;
                            if (!viPut32(SYSTEM_VI(gpSystem), 0xA4400010, (s32*)&nData32)) {
                                return false;
                            }
                            pCPU->aGPR[4].u32 = 0x38;
                            send_mesg(pCPU);
                        }

                        if (nS1 & 4) {
                            nData32 = 1;
                            nS1 &= 0x3B;
                            if (!aiPut32(SYSTEM_AI(gpSystem), 0xA450000C, (s32*)&nData32)) {
                                return false;
                            }
                            pCPU->aGPR[4].u32 = 0x30;
                            send_mesg(pCPU);
                        }

                        if (nS1 & 2) {
                            nData32 = 0;
                            nS1 &= 0x3D;
                            if (!siPut32(SYSTEM_SI(gpSystem), 0xA4800018, (s32*)&nData32)) {
                                return false;
                            }
                            pCPU->aGPR[4].u32 = 0x28;
                            send_mesg(pCPU);
                        }

                        if (nS1 & 0x10) {
                            nData32 = 2;
                            nS1 &= 0x2F;
                            if (!piPut32(SYSTEM_PI(gpSystem), 0xA4600010, (s32*)&nData32)) {
                                return false;
                            }
                            pCPU->aGPR[4].u32 = 0x40;
                            send_mesg(pCPU);
                        }

                        if (nS1 & 0x20) {
                            nData32 = 0x800;
                            if (!miPut32(SYSTEM_MI(gpSystem), 0xA4300000, (s32*)&nData32)) {
                                return false;
                            }
                            pCPU->aGPR[4].u32 = 0x48;
                            send_mesg(pCPU);
                        }

                        nS0 &= ~0x400;
                        break;
                    case 4:
                        pCPU->aGPR[4].u32 = 0x10;
                        nS0 &= ~0x800;
                        send_mesg(pCPU);
                        break;
                    case 5:
                        __osRunningThread->context.sr &= ~0x1000;
                        goto redispatch;
                    case 6:
                        nS0 &= ~0x2000;
                        break;
                    case 7:
                        nS0 &= ~0x4000;
                        break;
                    case 8:
                        if (!cpuGetRegisterCP0(pCPU, 11, &nData64)) {
                            return false;
                        }
                        if (!cpuSetRegisterCP0(pCPU, 11, nData64)) {
                            return false;
                        }
                        pCPU->aGPR[4].u32 = 0x18;
                        send_mesg(pCPU);
                        nS0 &= ~0x8000;
                        break;
                    default:
                        goto redispatch;
                }
            }
            break;
        case CEC_BREAK:
            __osRunningThread->flags = 1;
            pCPU->aGPR[4].u32 = 0x50;
            send_mesg(pCPU);
            goto redispatch;
        case CEC_COPROCESSOR:
            __osRunningThread->fp = 1;
            if (!cpuGetRegisterCP0(pCPU, 12, &nData64)) {
                return false;
            }
            nData64 |= 0x20000000;
            if (!cpuSetRegisterCP0(pCPU, 12, nData64)) {
                return false;
            }
            goto enqueueRunning;
        default:
            *(s32*)pLibrary->apData[7] = pCPU->aGPR[26].s32;
            __osRunningThread->state = 1;
            __osRunningThread->flags = 2;
            if (!cpuGetRegisterCP0(pCPU, 8, &nData64)) {
                return false;
            }
            nData32 = nData64;
            __osRunningThread->context.badvaddr = nData32;
            pCPU->aGPR[4].u32 = 0x60;
            send_mesg(pCPU);
            __osDispatchThread(pCPU);
            return true;
    }

redispatch:
    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[26].u32 + 4, &pCPU->aGPR[9].u32);
    CPU_DEVICE_GET32(apDevice, aiDevice, pLibrary->anAddress[4], &pCPU->aGPR[10].u32);
    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[10].u32 + 4, &pCPU->aGPR[11].u32);
    if (pCPU->aGPR[9].u32 < pCPU->aGPR[11].u32) {
        pCPU->aGPR[5].u32 = pCPU->aGPR[26].u32;
        pCPU->aGPR[4].u32 = pLibrary->anAddress[4];
        __osEnqueueThread(pCPU);
        goto dispatchThread;
    }

enqueueRunning:
    pCPU->aGPR[9].u32 = pLibrary->anAddress[4];
    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[9].u32, &pCPU->aGPR[10].u32);
    CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[26].u32, &pCPU->aGPR[10].u32);
    CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[9].u32, &pCPU->aGPR[26].u32);

dispatchThread:
    __osDispatchThread(pCPU);
    return true;
}

static u32 __osRcpImTable[] = {
    0x00000555, 0x00000556, 0x00000559, 0x0000055A, 0x00000565, 0x00000566, 0x00000569, 0x0000056A,
    0x00000595, 0x00000596, 0x00000599, 0x0000059A, 0x000005A5, 0x000005A6, 0x000005A9, 0x000005AA,
    0x00000655, 0x00000656, 0x00000659, 0x0000065A, 0x00000665, 0x00000666, 0x00000669, 0x0000066A,
    0x00000695, 0x00000696, 0x00000699, 0x0000069A, 0x000006A5, 0x000006A6, 0x000006A9, 0x000006AA,
    0x00000955, 0x00000956, 0x00000959, 0x0000095A, 0x00000965, 0x00000966, 0x00000969, 0x0000096A,
    0x00000995, 0x00000996, 0x00000999, 0x0000099A, 0x000009A5, 0x000009A6, 0x000009A9, 0x000009AA,
    0x00000A55, 0x00000A56, 0x00000A59, 0x00000A5A, 0x00000A65, 0x00000A66, 0x00000A69, 0x00000A6A,
    0x00000A95, 0x00000A96, 0x00000A99, 0x00000A9A, 0x00000AA5, 0x00000AA6, 0x00000AA9, 0x00000AAA,
};

static bool send_mesg(Cpu* pCPU) {
    Library* pLibrary;
    CpuDevice** apDevice;
    u8* aiDevice;

    aiDevice = pCPU->aiDevice;
    apDevice = pCPU->apDevice;
    pLibrary = SYSTEM_LIBRARY(gpSystem);

    pCPU->aGPR[10].u32 = pLibrary->anAddress[9];
    pCPU->aGPR[10].u32 += pCPU->aGPR[4].u32;
    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[10].u32, &pCPU->aGPR[9].u32);

    if (pCPU->aGPR[9].u32 != 0) {
        CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[9].u32 + 0x08, &pCPU->aGPR[11].s32);
        CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[9].u32 + 0x10, &pCPU->aGPR[12].s32);

        if (pCPU->aGPR[11].s32 < pCPU->aGPR[12].s32) {
            CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[9].u32 + 0x0C, &pCPU->aGPR[13].u32);
            pCPU->aGPR[13].u32 += pCPU->aGPR[11].u32;
            pCPU->aGPR[13].u32 %= pCPU->aGPR[12].u32;
            CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[9].u32 + 0x14, &pCPU->aGPR[12].u32);
            pCPU->aGPR[13].u32 *= 4;
            pCPU->aGPR[12].s32 += pCPU->aGPR[13].u32;
            CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[10].u32 + 0x04, &pCPU->aGPR[13].u32);
            CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[12].u32, &pCPU->aGPR[13].u32);
            pCPU->aGPR[10].s32 = pCPU->aGPR[11].s32 + 1;
            CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[9].u32 + 0x08, &pCPU->aGPR[10].u32);
            CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[9].u32 + 0x00, &pCPU->aGPR[10].u32);
            CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[10].u32, &pCPU->aGPR[11].u32);

            if (pCPU->aGPR[11].u32 != 0) {
                pCPU->aGPR[4].u32 = pCPU->aGPR[9].u32;
                CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[4].u32, &pCPU->aGPR[2].u32);
                CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[2].u32, &pCPU->aGPR[25].u32);
                CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[4].u32, &pCPU->aGPR[25].u32);
                pCPU->aGPR[10].u32 = pCPU->aGPR[2].u32;
                pCPU->aGPR[5].u32 = pCPU->aGPR[10].u32;
                pCPU->aGPR[4].u32 = pLibrary->anAddress[4];

                __osEnqueueThread(pCPU);
            }
        }
    }

    return true;
}

static bool __osEnqueueAndYield(Cpu* pCPU) {
    s64 nData64;
    Library* pLibrary;
    __OSThread_s* __osRunningThread;
    u32 __OSGlobalIntMask;
    u32 nStatus;
    u32 nData32;
    u32 nMask;
    CpuDevice** apDevice;
    u8* aiDevice;

    apDevice = pCPU->apDevice;
    aiDevice = pCPU->aiDevice;
    pLibrary = SYSTEM_LIBRARY(gpSystem);
    __OSGlobalIntMask = *(u32*)pLibrary->apData[3];
    CPU_DEVICE_GET32(apDevice, aiDevice, pLibrary->anAddress[8], &pCPU->aGPR[5].u32);

    if (!cpuGetAddressBuffer(pCPU, (void**)&__osRunningThread, pCPU->aGPR[5].u32)) {
        return false;
    }

    if (!cpuGetRegisterCP0(pCPU, 0xC, &nData64)) {
        return false;
    }

    nStatus = nData64 | 2;
    __osRunningThread->context.sr = nStatus;

    __osRunningThread->context.s0 = pCPU->aGPR[16].u64;
    __osRunningThread->context.s1 = pCPU->aGPR[17].u64;
    __osRunningThread->context.s2 = pCPU->aGPR[18].u64;
    __osRunningThread->context.s3 = pCPU->aGPR[19].u64;
    __osRunningThread->context.s4 = pCPU->aGPR[20].u64;
    __osRunningThread->context.s5 = pCPU->aGPR[21].u64;
    __osRunningThread->context.s6 = pCPU->aGPR[22].u64;
    __osRunningThread->context.s7 = pCPU->aGPR[23].u64;
    __osRunningThread->context.gp = pCPU->aGPR[28].u64;
    __osRunningThread->context.sp = pCPU->aGPR[29].u64;
    __osRunningThread->context.s8 = pCPU->aGPR[30].u64;
    __osRunningThread->context.ra = pCPU->aGPR[31].u64;

    __osRunningThread->context.pc = pCPU->nReturnAddrLast;
    __osRunningThread->context.fpcsr = pCPU->anFCR[31];

    __osRunningThread->context.fp20.u64 = pCPU->aFPR[20].u64;
    __osRunningThread->context.fp22.u64 = pCPU->aFPR[22].u64;
    __osRunningThread->context.fp24.u64 = pCPU->aFPR[24].u64;
    __osRunningThread->context.fp26.u64 = pCPU->aFPR[26].u64;
    __osRunningThread->context.fp28.u64 = pCPU->aFPR[28].u64;
    __osRunningThread->context.fp30.u64 = pCPU->aFPR[30].u64;

    if (nStatus & 0xFF00) {
        nData32 = ~__OSGlobalIntMask;
        nData32 &= 0xFF00;
        nData32 |= nStatus & 0xFF00;
        nData32 |= nStatus & 0xFFFF00FF;
        __osRunningThread->context.sr = nData32;
    }

    if (!miGet32(SYSTEM_MI(gpSystem), 0xA430000C, (s32*)&nMask)) {
        return false;
    }

    if (nMask != 0) {
        nData32 = __OSGlobalIntMask >> 16;
        nData32 = ~nData32;
        nData32 &= 0x3F;
        nMask |= nData32 & __osRunningThread->context.rcp;
    }

    __osRunningThread->context.rcp = nMask;
    if (pCPU->aGPR[4].u32 != 0) {
        __osEnqueueThread(pCPU);
    }

    __osDispatchThread(pCPU);
    return true;
}

static bool __osEnqueueThread(Cpu* pCPU) {
    CpuDevice** apDevice = pCPU->apDevice;
    u8* aiDevice = pCPU->aiDevice;

    pCPU->aGPR[25].u32 = pCPU->aGPR[4].u32;
    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[4].u32, &pCPU->aGPR[24].u32);
    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[5].u32 + 4, &pCPU->aGPR[15].u32);
    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[24].u32 + 4, &pCPU->aGPR[14].u32);

    while (pCPU->aGPR[14].s32 >= pCPU->aGPR[15].s32) {
        pCPU->aGPR[25].u32 = pCPU->aGPR[24].u32;
        CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[24].u32, &pCPU->aGPR[24].u32);
        CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[24].u32 + 4, &pCPU->aGPR[14].u32);
    }

    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[25].u32, &pCPU->aGPR[24].u32);
    CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[5].u32, &pCPU->aGPR[24].u32);
    CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[25].u32, &pCPU->aGPR[5].u32);
    CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[5].u32 + 8, &pCPU->aGPR[4].u32);

    return true;
}

static bool __osPopThread(Cpu* pCPU) {
    CpuDevice** apDevice = pCPU->apDevice;
    u8* aiDevice = pCPU->aiDevice;

    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[4].u32, &pCPU->aGPR[2].u32);
    CPU_DEVICE_GET32(apDevice, aiDevice, pCPU->aGPR[2].u32, &pCPU->aGPR[25].u32);
    CPU_DEVICE_PUT32(apDevice, aiDevice, pCPU->aGPR[4].u32, &pCPU->aGPR[25].u32);
    return true;
}

static bool __osDispatchThread(Cpu* pCPU) {
    Library* pLibrary;
    u32 nAddress;
    u64 nData64;
    __OSThread_s* __osRunningThread;
    u32 nData32;
    u32 __OSGlobalIntMask;
    u32 nStatus;
    u32 nMask;

    pLibrary = SYSTEM_LIBRARY(gpSystem);

    nData32 = *(u32*)pLibrary->apData[3];
    __OSGlobalIntMask = nData32;

    pCPU->aGPR[4].u32 = pLibrary->anAddress[4];

    __osPopThread(pCPU);

    nAddress = pCPU->aGPR[2].u32;
    *(u32*)pLibrary->apData[8] = nAddress;

    if (!cpuGetAddressBuffer(pCPU, (void**)&__osRunningThread, nAddress)) {
        return false;
    }

    __osRunningThread->state = 4;
    nStatus = __osRunningThread->context.sr;

    nData32 = __OSGlobalIntMask & 0xFF00;
    nData32 &= nStatus & 0xFF00;

    nStatus = (nStatus & 0xFFFF00FF) | nData32;
    nData64 = nStatus;
    if (!cpuSetRegisterCP0(pCPU, 12, nData64)) {
        return false;
    }

    pCPU->aGPR[1].u64 = __osRunningThread->context.at;
    pCPU->aGPR[2].u64 = __osRunningThread->context.v0;
    pCPU->aGPR[3].u64 = __osRunningThread->context.v1;
    pCPU->aGPR[4].u64 = __osRunningThread->context.a0;
    pCPU->aGPR[5].u64 = __osRunningThread->context.a1;
    pCPU->aGPR[6].u64 = __osRunningThread->context.a2;
    pCPU->aGPR[7].u64 = __osRunningThread->context.a3;
    pCPU->aGPR[8].u64 = __osRunningThread->context.t0;
    pCPU->aGPR[9].u64 = __osRunningThread->context.t1;
    pCPU->aGPR[10].u64 = __osRunningThread->context.t2;
    pCPU->aGPR[11].u64 = __osRunningThread->context.t3;
    pCPU->aGPR[12].u64 = __osRunningThread->context.t4;
    pCPU->aGPR[13].u64 = __osRunningThread->context.t5;
    pCPU->aGPR[14].u64 = __osRunningThread->context.t6;
    pCPU->aGPR[15].u64 = __osRunningThread->context.t7;
    pCPU->aGPR[16].u64 = __osRunningThread->context.s0;
    pCPU->aGPR[17].u64 = __osRunningThread->context.s1;
    pCPU->aGPR[18].u64 = __osRunningThread->context.s2;
    pCPU->aGPR[19].u64 = __osRunningThread->context.s3;
    pCPU->aGPR[20].u64 = __osRunningThread->context.s4;
    pCPU->aGPR[21].u64 = __osRunningThread->context.s5;
    pCPU->aGPR[22].u64 = __osRunningThread->context.s6;
    pCPU->aGPR[23].u64 = __osRunningThread->context.s7;
    pCPU->aGPR[24].u64 = __osRunningThread->context.t8;
    pCPU->aGPR[25].u64 = __osRunningThread->context.t9;
    pCPU->aGPR[28].u64 = __osRunningThread->context.gp;
    pCPU->aGPR[29].u64 = __osRunningThread->context.sp;
    pCPU->aGPR[30].u64 = __osRunningThread->context.s8;
    pCPU->aGPR[31].u64 = __osRunningThread->context.ra;
    pCPU->nLo = __osRunningThread->context.lo;
    pCPU->nHi = __osRunningThread->context.hi;

    nData32 = __osRunningThread->context.pc;
    pCPU->anCP0[14] = nData32;

    pCPU->anFCR[31] = __osRunningThread->context.fpcsr;
    pCPU->aFPR[0].u64 = __osRunningThread->context.fp0.u64;
    pCPU->aFPR[2].u64 = __osRunningThread->context.fp2.u64;
    pCPU->aFPR[4].u64 = __osRunningThread->context.fp4.u64;
    pCPU->aFPR[6].u64 = __osRunningThread->context.fp6.u64;
    pCPU->aFPR[8].u64 = __osRunningThread->context.fp8.u64;
    pCPU->aFPR[10].u64 = __osRunningThread->context.fp10.u64;
    pCPU->aFPR[12].u64 = __osRunningThread->context.fp12.u64;
    pCPU->aFPR[14].u64 = __osRunningThread->context.fp14.u64;
    pCPU->aFPR[16].u64 = __osRunningThread->context.fp16.u64;
    pCPU->aFPR[18].u64 = __osRunningThread->context.fp18.u64;
    pCPU->aFPR[20].u64 = __osRunningThread->context.fp20.u64;
    pCPU->aFPR[22].u64 = __osRunningThread->context.fp22.u64;
    pCPU->aFPR[24].u64 = __osRunningThread->context.fp24.u64;
    pCPU->aFPR[26].u64 = __osRunningThread->context.fp26.u64;
    pCPU->aFPR[28].u64 = __osRunningThread->context.fp28.u64;
    pCPU->aFPR[30].u64 = __osRunningThread->context.fp30.u64;

    nMask = __osRunningThread->context.rcp;

    nData32 = __OSGlobalIntMask;
    nData32 >>= 16;

    nMask &= nData32;
    nData32 = __osRcpImTable[nMask];

    if (!miPut32(SYSTEM_MI(gpSystem), 0xA430000C, (s32*)&nData32)) {
        return false;
    }

    __cpuERET(pCPU);
    return true;
}

static bool osGetMemSize(Cpu* pCPU) {
    u32 nSize;

    if (!ramGetSize(SYSTEM_RAM(gpSystem), (s32*)&nSize)) {
        return false;
    }

    pCPU->aGPR[2].u32 = nSize;
    return true;
}

static bool osInvalICache(Cpu* pCPU) {
    u32 nAddress = pCPU->aGPR[4].u32;
    u32 nSize = pCPU->aGPR[5].u32;

    if (!cpuInvalidateCache(pCPU, nAddress, nAddress + nSize)) {
        return false;
    }

    if (!rspInvalidateCache(SYSTEM_RSP(gpSystem), nAddress, nAddress + nSize)) {
        return false;
    }

    return true;
}

static bool __osDisableInt(Cpu* pCPU) {
    u32 nStatus;
    u64 nData64;

    if (!cpuGetRegisterCP0(pCPU, 12, (s64*)&nData64)) {
        return false;
    }

    nStatus = nData64;
    ;
    nData64 = nStatus & ~1;
    if (!cpuSetRegisterCP0(pCPU, 12, nData64)) {
        return false;
    }

    pCPU->aGPR[2].s32 = nStatus & 1;
    return true;
}

bool __osRestoreInt(Cpu* pCPU) {
    u64 nStatus;

    if (!cpuGetRegisterCP0(pCPU, 12, (s64*)&nStatus)) {
        return false;
    }

    nStatus |= pCPU->aGPR[4].u64;
    if (!cpuSetRegisterCP0(pCPU, 12, nStatus)) {
        return false;
    }

    return true;
}

bool __osSpSetStatus(Cpu* pCPU) {
    u32 nData32 = pCPU->aGPR[4].u32;

    if (!rspPut32(SYSTEM_RSP(gpSystem), 0x04040010, (s32*)&nData32)) {
        return false;
    }

    return true;
}

static void __cosf(Cpu* pCPU) { pCPU->aFPR[0].f32 = cosf(pCPU->aFPR[12].f32); }

static void __sinf(Cpu* pCPU) { pCPU->aFPR[0].f32 = sinf(pCPU->aFPR[12].f32); }

#if IS_SM64
void _bzero(Cpu* pCPU) {
    s32 nSize;
    void* pBuffer;

    cpuGetAddressBuffer(pCPU, &pBuffer, pCPU->aGPR[4].u32);
    nSize = pCPU->aGPR[5].s32;

    memset(pBuffer, 0, nSize);
}

void _bcopy(Cpu* pCPU) {
    s32 nSize;
    void* pSource;
    void* pTarget;

    cpuGetAddressBuffer(pCPU, &pSource, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, &pTarget, pCPU->aGPR[5].u32);
    nSize = pCPU->aGPR[6].s32;

    xlHeapCopy(pTarget, pSource, nSize);
    pCPU->aGPR[2].u32 = pCPU->aGPR[5].u32;
}

void _memcpy(Cpu* pCPU) {
    s32 nSize;
    void* pSource;
    void* pTarget;

    cpuGetAddressBuffer(pCPU, &pTarget, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, &pSource, pCPU->aGPR[5].u32);
    nSize = pCPU->aGPR[6].s32;

    xlHeapCopy(pTarget, pSource, nSize);
    pCPU->aGPR[2].u32 = pCPU->aGPR[4].u32;
}
#else
void _bzero(Cpu* pCPU) {
    s32 nSize = pCPU->aGPR[5].s32;
    void* pBuffer;

    if (cpuGetAddressBuffer(pCPU, &pBuffer, pCPU->aGPR[4].u32) && nSize > 0) {
        memset(pBuffer, 0, nSize);
    }
}

void _bcopy(Cpu* pCPU) {
    s32 nSize = pCPU->aGPR[6].s32;
    void* pSource;
    void* pTarget;

    if (cpuGetAddressBuffer(pCPU, &pSource, pCPU->aGPR[4].u32) &&
        cpuGetAddressBuffer(pCPU, &pTarget, pCPU->aGPR[5].u32) && nSize > 0) {
        xlHeapCopy(pTarget, pSource, nSize);
    }
    pCPU->aGPR[2].u32 = pCPU->aGPR[5].u32;
}

void _memcpy(Cpu* pCPU) {
    s32 nSize = pCPU->aGPR[6].s32;
    void* pSource;
    void* pTarget;

    if (cpuGetAddressBuffer(pCPU, &pTarget, pCPU->aGPR[4].u32) &&
        cpuGetAddressBuffer(pCPU, &pSource, pCPU->aGPR[5].u32) && nSize > 0) {
        xlHeapCopy(pTarget, pSource, nSize);
    }
    pCPU->aGPR[2].u32 = pCPU->aGPR[4].u32;
}
#endif

void osPhysicalToVirtual(Cpu* pCPU) { pCPU->aGPR[2].u32 = pCPU->aGPR[4].u32 | 0x80000000; }

void osVirtualToPhysical(Cpu* pCPU) {
    if (pCPU->aGPR[4].s32 >= 0x80000000 && pCPU->aGPR[4].s32 < 0xA0000000) {
        pCPU->aGPR[2].s32 = pCPU->aGPR[4].s32 & 0x1FFFFFFF;
    } else if (pCPU->aGPR[4].s32 >= 0xA0000000 && pCPU->aGPR[4].s32 < 0xC0000000) {
        pCPU->aGPR[2].s32 = pCPU->aGPR[4].s32 & 0x1FFFFFFF;
    } else {
        pCPU->aGPR[2].s32 =
            pCPU->aGPR[4].s32 + CPU_DEVICE(pCPU->apDevice, pCPU->aiDevice, pCPU->aGPR[4].s32)->nOffsetAddress;
    }
}

void guMtxCatF(Cpu* pCPU) {
    s32 i;
    s32 j;
    s32 k;
    f32 temp[4][4];
    CpuFpr data1;
    CpuFpr data2;
    u32* mf;
    u32* nf;
    u32* res;

    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&nf, pCPU->aGPR[5].u32);
    cpuGetAddressBuffer(pCPU, (void**)&res, pCPU->aGPR[6].u32);

    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j++) {
            temp[i][j] = 0.0f;
            for (k = 0; k < 4; k++) {
                data1.u32 = mf[i * 4 + k];
                data2.u32 = nf[k * 4 + j];
                temp[i][j] += data1.f32 * data2.f32;
            }
        }
    }

    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j++) {
            data1.f32 = temp[i][j];
            res[i * 4 + j] = data1.u32;
        }
    }
}

void guMtxF2L(Cpu* pCPU) {
    f32* mf;
    s32 e1;
    s32 e2;
    s32 i;
    s32 j;
    s32* m;
    CpuFpr data;
    s32* ai;
    s32* af;

    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&m, pCPU->aGPR[5].u32);
    frameFixMatrixHint(SYSTEM_FRAME(gpSystem), pCPU->aGPR[4].u32, pCPU->aGPR[5].u32);

    ai = &m[0];
    af = &m[8];
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j += 2) {
            data.f32 = mf[i * 4 + j];
            e1 = 0x10000 * data.f32;
            data.f32 = mf[i * 4 + j + 1];
            e2 = 0x10000 * data.f32;
            *(ai++) = (e1 & 0xFFFF0000) | ((e2 >> 16) & 0xFFFF);
            *(af++) = ((e1 << 16) & 0xFFFF0000) | (e2 & 0xFFFF);
        }
    }
}

void guMtxIdentF(Cpu* pCPU) {
    f32* mf;
    s32 i;
    s32 j;
    CpuFpr data1;
    CpuFpr data0;

    data0.f32 = 0.0f;
    data1.f32 = 1.0f;
    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);

    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j++) {
            if (i == j) {
                mf[i * 4 + j] = data1.f32;
            } else {
                mf[i * 4 + j] = data0.f32;
            }
        }
    }
}

void guMtxIdent(Cpu* pCPU) {
    s32* m;

    cpuGetAddressBuffer(pCPU, (void**)&m, pCPU->aGPR[4].u32);
    m[0] = 0x10000;
    m[1] = 0;
    m[2] = 1;
    m[3] = 0;
    m[4] = 0;
    m[5] = 0x10000;
    m[6] = 0;
    m[7] = 1;
    m[8] = 0;
    m[9] = 0;
    m[10] = 0;
    m[11] = 0;
    m[12] = 0;
    m[13] = 0;
    m[14] = 0;
    m[15] = 0;
}

void guOrthoF(Cpu* pCPU) {
    s32 i;
    s32 j;
    u32* mf;
    u32* sp;
    f32 l;
    f32 r;
    f32 b;
    f32 t;
    f32 n;
    f32 f;
    f32 scale;
    CpuFpr data0;
    CpuFpr data1;
    CpuFpr data;

    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[5].u32;
    l = data.f32;

    data.u32 = pCPU->aGPR[6].u32;
    r = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    b = data.f32;

    data.u32 = sp[4];
    t = data.f32;

    data.u32 = sp[5];
    n = data.f32;

    data.u32 = sp[6];
    f = data.f32;

    data.u32 = sp[7];
    scale = data.f32;

    data0.f32 = 0.0f;
    data1.f32 = 1.0f;

#if IS_SM64
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_ORTHOGRAPHIC, pCPU->aGPR[4].u32, 0, n, f, 0.0f, 0.0f, scale);
#endif

    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j++) {
            if (i == j) {
                mf[i * 4 + j] = data1.u32;
            } else {
                mf[i * 4 + j] = data0.u32;
            }
        }
    }

    data.f32 = 2 / (r - l);
    mf[0 * 4 + 0] = data.u32;

    data.f32 = 2 / (t - b);
    mf[1 * 4 + 1] = data.u32;

    data.f32 = -2 / (f - n);
    mf[2 * 4 + 2] = data.u32;

    data.f32 = -(r + l) / (r - l);
    mf[3 * 4 + 0] = data.u32;

    data.f32 = -(t + b) / (t - b);
    mf[3 * 4 + 1] = data.u32;

    data.f32 = -(f + n) / (f - n);
    mf[3 * 4 + 2] = data.u32;

    data.f32 = 1.0f;
    mf[3 * 4 + 3] = data.u32;

#if VERSION >= MK64_J
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_ORTHOGRAPHIC, pCPU->aGPR[4].u32, 0, n, f, 0.0f, 0.0f, scale,
                       (void*)mf);
#endif
}

void guOrtho(Cpu* pCPU) {
    s32* m;
    s32 i;
    s32 j;
    s32 e1;
    s32 e2;
    CpuFpr data;
    f32 mf[4][4];
    u32* sp;
    s32* ai;
    s32* af;
    f32 l;
    f32 r;
    f32 b;
    f32 t;
    f32 n;
    f32 f;
    f32 scale;

    cpuGetAddressBuffer(pCPU, (void**)&m, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[5].u32;
    l = data.f32;

    data.u32 = pCPU->aGPR[6].u32;
    r = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    b = data.f32;

    data.u32 = sp[4];
    t = data.f32;

    data.u32 = sp[5];
    n = data.f32;

    data.u32 = sp[6];
    f = data.f32;

    data.u32 = sp[7];
    scale = data.f32;

#if IS_SM64
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_ORTHOGRAPHIC, 0, pCPU->aGPR[4].u32, n, f, 0.0f, 0.0f, scale);
#endif

    mf[0][0] = 1.0f;
    mf[0][1] = 0.0f;
    mf[0][2] = 0.0f;
    mf[0][3] = 0.0f;
    mf[1][0] = 0.0f;
    mf[1][1] = 1.0f;
    mf[1][2] = 0.0f;
    mf[1][3] = 0.0f;
    mf[2][0] = 0.0f;
    mf[2][1] = 0.0f;
    mf[2][2] = 1.0f;
    mf[2][3] = 0.0f;
    mf[3][0] = 0.0f;
    mf[3][1] = 0.0f;
    mf[3][2] = 0.0f;
    mf[3][3] = 1.0f;

    mf[0][0] = 2 / (r - l);
    mf[1][1] = 2 / (t - b);
    mf[2][2] = -2 / (f - n);
    mf[3][0] = -(r + l) / (r - l);
    mf[3][1] = -(t + b) / (t - b);
    mf[3][2] = -(f + n) / (f - n);
    mf[3][3] = 1.0f;

#if VERSION >= MK64_J
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_ORTHOGRAPHIC, 0, pCPU->aGPR[4].u32, n, f, 0.0f, 0.0f, scale,
                       (void*)mf);
#endif

    ai = &m[0];
    af = &m[8];
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j += 2) {
            e1 = 0x10000 * mf[i][j];
            e2 = 0x10000 * mf[i][j + 1];
            *(ai++) = (e1 & 0xFFFF0000) | ((e2 >> 16) & 0xFFFF);
            *(af++) = ((e1 << 16) & 0xFFFF0000) | (e2 & 0xFFFF);
        }
    }
}

void guPerspectiveF(Cpu* pCPU) {
    s32 i;
    s32 j;
    f32 cot;
    s16* perspNorm;
    u32* mf;
    u32* sp;
    CpuFpr data0;
    CpuFpr data1;
    CpuFpr data;
    f32 fovy;
    f32 aspect;
    f32 rNear;
    f32 rFar;
    f32 scale;

    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);
    cpuGetAddressBuffer(pCPU, (void**)&perspNorm, pCPU->aGPR[5].u32);

    data.u32 = pCPU->aGPR[6].u32;
    fovy = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    aspect = data.f32;

    data.u32 = sp[4];
    rNear = data.f32;

    data.u32 = sp[5];
    rFar = data.f32;

    data.u32 = sp[6];
    scale = data.f32;

    data0.f32 = 0.0f;
    data1.f32 = 1.0f;

#if IS_SM64
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_PERSPECTIVE, pCPU->aGPR[4].u32, 0, rNear, rFar, fovy, aspect, scale);
#endif

    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j++) {
            if (i == j) {
                mf[i * 4 + j] = data1.u32;
            } else {
                mf[i * 4 + j] = data0.u32;
            }
        }
    }

    fovy *= (f32)M_PI / 180;
    cot = cosf(fovy / 2) / sinf(fovy / 2);

    data.f32 = cot / aspect;
    mf[0 * 4 + 0] = data.u32;

    data.f32 = cot;
    mf[1 * 4 + 1] = data.u32;

    data.f32 = (rNear + rFar) / (rNear - rFar);
    mf[2 * 4 + 2] = data.u32;

    data.f32 = -1.0f;
    mf[2 * 4 + 3] = data.u32;

    data.f32 = 2 * rNear * rFar / (rNear - rFar);
    mf[3 * 4 + 2] = data.u32;

    data.f32 = 0.0f;
    mf[3 * 4 + 3] = data.u32;

#if VERSION >= MK64_J
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_PERSPECTIVE, pCPU->aGPR[4].u32, 0, rNear, rFar, fovy, aspect, scale,
                       (void*)mf);
#endif
}

void guPerspective(Cpu* pCPU) {
    s32* m;
    f32 fovy;
    f32 aspect;
    f32 rNear;
    f32 rFar;
    f32 scale;
    f32 _cot;
    s32 i;
    s32 j;
    CpuFpr data;
    f32 mf[4][4];
    s32 e1;
    s32 e2;
    u32* sp;
    s32* ai;
    s32* af;

    cpuGetAddressBuffer(pCPU, (void**)&m, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[6].u32;
    fovy = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    aspect = data.f32;

    data.u32 = sp[4];
    rNear = data.f32;

    data.u32 = sp[5];
    rFar = data.f32;

    data.u32 = sp[6];
    scale = data.f32;

#if IS_SM64
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_PERSPECTIVE, 0, pCPU->aGPR[4].u32, rNear, rFar, fovy, aspect, scale);
#endif

    mf[0][0] = 1.0f;
    mf[0][1] = 0.0f;
    mf[0][2] = 0.0f;
    mf[0][3] = 0.0f;
    mf[1][0] = 0.0f;
    mf[1][1] = 1.0f;
    mf[1][2] = 0.0f;
    mf[1][3] = 0.0f;
    mf[2][0] = 0.0f;
    mf[2][1] = 0.0f;
    mf[2][2] = 1.0f;
    mf[2][3] = 0.0f;
    mf[3][0] = 0.0f;
    mf[3][1] = 0.0f;
    mf[3][2] = 0.0f;
    mf[3][3] = 1.0f;

    fovy *= (f32)M_PI / 180;
    _cot = cosf(fovy / 2) / sinf(fovy / 2);

    mf[0][0] = _cot / aspect;
    mf[1][1] = _cot;
    mf[2][2] = (rNear + rFar) / (rNear - rFar);
    mf[2][3] = -1.0f;
    mf[3][2] = 2 * rNear * rFar / (rNear - rFar);
    mf[3][3] = 0.0f;

#if VERSION >= MK64_J
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_PERSPECTIVE, 0, pCPU->aGPR[4].u32, rNear, rFar, fovy, aspect, scale,
                       (void*)mf);
#endif

    ai = &m[0];
    af = &m[8];
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j += 2) {
            e1 = 0x10000 * mf[i][j];
            e2 = 0x10000 * mf[i][j + 1];
            *(ai++) = (e1 & 0xFFFF0000) | ((e2 >> 16) & 0xFFFF);
            *(af++) = ((e1 << 16) & 0xFFFF0000) | (e2 & 0xFFFF);
        }
    }
}

void GenPerspective_1080(Cpu* pCPU) {
    CpuFpr data;
    u32* mf;
    u32* sp;
    f32 fovy;
    f32 aspect;
    f32 rNear;
    f32 rFar;
    Frame* pFrame = SYSTEM_FRAME(gpSystem);

    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[5].u32;
    fovy = data.f32;

    data.u32 = pCPU->aGPR[6].u32;
    aspect = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    rNear = data.f32;

    data.u32 = sp[4];
    rFar = data.f32;

#if IS_SM64
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_PERSPECTIVE, pCPU->aGPR[4].u32, 0, rNear, rFar, fovy, aspect, 1.0f);
#else
    frameSetMatrixHint(SYSTEM_FRAME(gpSystem), FMP_PERSPECTIVE, pCPU->aGPR[4].u32, 0, rNear, rFar, fovy, aspect, 1.0f,
                       NULL);
#endif
    pFrame->iHintHack = pFrame->iHintLast;
}

void guScaleF(Cpu* pCPU) {
    s32 i;
    s32 j;
    u32* mf;
    CpuFpr data0;
    CpuFpr data1;

    data0.f32 = 0.0f;
    data1.f32 = 1.0f;
    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);

    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j++) {
            if (i == j) {
                mf[i * 4 + j] = data1.u32;
            } else {
                mf[i * 4 + j] = data0.u32;
            }
        }
    }

    mf[0 * 4 + 0] = pCPU->aGPR[5].s32;
    mf[1 * 4 + 1] = pCPU->aGPR[6].s32;
    mf[2 * 4 + 2] = pCPU->aGPR[7].s32;
    mf[3 * 4 + 3] = data1.u32;
}

void guScale(Cpu* pCPU) {
    f32 mf[4][4];
    s32* m;
    s32 i;
    s32 j;
    s32 e1;
    s32 e2;
    CpuFpr data;
    s32* ai;
    s32* af;

    cpuGetAddressBuffer(pCPU, (void**)&m, pCPU->aGPR[4].u32);

    mf[0][0] = 1.0f;
    mf[0][1] = 0.0f;
    mf[0][2] = 0.0f;
    mf[0][3] = 0.0f;
    mf[1][0] = 0.0f;
    mf[1][1] = 1.0f;
    mf[1][2] = 0.0f;
    mf[1][3] = 0.0f;
    mf[2][0] = 0.0f;
    mf[2][1] = 0.0f;
    mf[2][2] = 1.0f;
    mf[2][3] = 0.0f;
    mf[3][0] = 0.0f;
    mf[3][1] = 0.0f;
    mf[3][2] = 0.0f;
    mf[3][3] = 1.0f;

    data.s32 = pCPU->aGPR[5].s32;
    mf[0][0] = data.f32;

    data.s32 = pCPU->aGPR[6].s32;
    mf[1][1] = data.f32;

    data.s32 = pCPU->aGPR[7].s32;
    mf[2][2] = data.f32;

    ai = &m[0];
    af = &m[8];
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j += 2) {
            e1 = 0x10000 * mf[i][j];
            e2 = 0x10000 * mf[i][j + 1];
            *(ai++) = (e1 & 0xFFFF0000) | ((e2 >> 16) & 0xFFFF);
            *(af++) = ((e1 << 16) & 0xFFFF0000) | (e2 & 0xFFFF);
        }
    }
}

void guTranslateF(Cpu* pCPU) {
    s32 i;
    s32 j;
    u32* mf;
    CpuFpr data0;
    CpuFpr data1;

    data0.f32 = 0.0f;
    data1.f32 = 1.0f;
    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);

    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j++) {
            if (i == j) {
                mf[i * 4 + j] = data1.u32;
            } else {
                mf[i * 4 + j] = data0.u32;
            }
        }
    }

    mf[3 * 4 + 0] = pCPU->aGPR[5].s32;
    mf[3 * 4 + 1] = pCPU->aGPR[6].s32;
    mf[3 * 4 + 2] = pCPU->aGPR[7].s32;
}

void guTranslate(Cpu* pCPU) {
    s32* m;
    s32 i;
    s32 j;
    s32 e1;
    s32 e2;
    CpuFpr data;
    f32 mf[4][4];
    s32* ai;
    s32* af;

    cpuGetAddressBuffer(pCPU, (void**)&m, pCPU->aGPR[4].u32);

    mf[0][0] = 1.0f;
    mf[0][1] = 0.0f;
    mf[0][2] = 0.0f;
    mf[0][3] = 0.0f;
    mf[1][0] = 0.0f;
    mf[1][1] = 1.0f;
    mf[1][2] = 0.0f;
    mf[1][3] = 0.0f;
    mf[2][0] = 0.0f;
    mf[2][1] = 0.0f;
    mf[2][2] = 1.0f;
    mf[2][3] = 0.0f;
    mf[3][0] = 0.0f;
    mf[3][1] = 0.0f;
    mf[3][2] = 0.0f;
    mf[3][3] = 1.0f;

    data.s32 = pCPU->aGPR[5].s32;
    mf[3][0] = data.f32;

    data.s32 = pCPU->aGPR[6].s32;
    mf[3][1] = data.f32;

    data.s32 = pCPU->aGPR[7].s32;
    mf[3][2] = data.f32;

    ai = &m[0];
    af = &m[8];
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j += 2) {
            e1 = 0x10000 * mf[i][j];
            e2 = 0x10000 * mf[i][j + 1];
            *(ai++) = (e1 & 0xFFFF0000) | ((e2 >> 16) & 0xFFFF);
            *(af++) = ((e1 << 16) & 0xFFFF0000) | (e2 & 0xFFFF);
        }
    }
}

void guRotateF(Cpu* pCPU) {
    f32 m;
    s32 i;
    s32 j;
    f32 a;
    f32 x;
    f32 y;
    f32 z;
    u32* mf;
    u32* sp;
    CpuFpr data;
    CpuFpr data0;
    CpuFpr data1;
    f32 sine;
    f32 cosine;
    f32 ab;
    f32 bc;
    f32 ca;
    f32 t;
    static f32 dtor = (f32)M_PI / 180;

    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[5].u32;
    a = data.f32;

    data.u32 = pCPU->aGPR[6].u32;
    x = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    y = data.f32;

    data.u32 = sp[4];
    z = data.f32;

    m = 1.0f / sqrtf(x * x + y * y + z * z);

    a *= dtor;
    x *= m;
    y *= m;
    z *= m;

    sine = sinf(a);
    cosine = cosf(a);

    t = 1.0f - cosine;
    ab = x * y * t;
    bc = y * z * t;
    ca = z * x * t;

    data0.f32 = 0.0f;
    data1.f32 = 1.0f;
    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);

    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j++) {
            if (i == j) {
                mf[i * 4 + j] = data1.u32;
            } else {
                mf[i * 4 + j] = data0.u32;
            }
        }
    }

    t = x * x;
    data.f32 = t + cosine * (1.0f - t);
    mf[0 * 4 + 0] = data.u32;

    data.f32 = bc - x * sine;
    mf[2 * 4 + 1] = data.u32;

    data.f32 = bc + x * sine;
    mf[1 * 4 + 2] = data.u32;

    t = y * y;
    data.f32 = t + cosine * (1.0f - t);
    mf[1 * 4 + 1] = data.u32;

    data.f32 = ca + y * sine;
    mf[2 * 4 + 0] = data.u32;

    data.f32 = ca - y * sine;
    mf[0 * 4 + 2] = data.u32;

    t = z * z;
    data.f32 = t + cosine * (1.0f - t);
    mf[2 * 4 + 2] = data.u32;

    data.f32 = ab - z * sine;
    mf[1 * 4 + 0] = data.u32;

    data.f32 = ab + z * sine;
    mf[0 * 4 + 1] = data.u32;
}

void guRotate(Cpu* pCPU) {
    s32* m;
    u32* sp;
    CpuFpr data;
    s32 i;
    s32 j;
    s32 e1;
    s32 e2;
    f32 mf[4][4];
    f32 sine;
    f32 cosine;
    f32 a;
    f32 x;
    f32 y;
    f32 z;
    f32 ab;
    f32 bc;
    f32 ca;
    f32 t;
    f32 magnitude;
    s32* ai;
    s32* af;
    static f32 dtor = (f32)M_PI / 180;

    cpuGetAddressBuffer(pCPU, (void**)&m, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[5].u32;
    a = data.f32;

    data.u32 = pCPU->aGPR[6].u32;
    x = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    y = data.f32;

    data.u32 = sp[4];
    z = data.f32;

    magnitude = 1.0f / sqrtf(x * x + y * y + z * z);

    a *= dtor;
    x *= magnitude;
    y *= magnitude;
    z *= magnitude;

    sine = sinf(a);
    cosine = cosf(a);

    t = 1.0f - cosine;
    ab = x * y * t;
    bc = y * z * t;
    ca = z * x * t;

    mf[0][0] = 1.0f;
    mf[0][1] = 0.0f;
    mf[0][2] = 0.0f;
    mf[0][3] = 0.0f;
    mf[1][0] = 0.0f;
    mf[1][1] = 1.0f;
    mf[1][2] = 0.0f;
    mf[1][3] = 0.0f;
    mf[2][0] = 0.0f;
    mf[2][1] = 0.0f;
    mf[2][2] = 1.0f;
    mf[2][3] = 0.0f;
    mf[3][0] = 0.0f;
    mf[3][1] = 0.0f;
    mf[3][2] = 0.0f;
    mf[3][3] = 1.0f;

    t = x * x;
    mf[0][0] = t + cosine * (1.0f - t);
    mf[2][1] = bc - x * sine;
    mf[1][2] = bc + x * sine;
    t = y * y;
    mf[1][1] = t + cosine * (1.0f - t);
    mf[2][0] = ca + y * sine;
    mf[0][2] = ca - y * sine;
    t = z * z;
    mf[2][2] = t + cosine * (1.0f - t);
    mf[1][0] = ab - z * sine;
    mf[0][1] = ab + z * sine;

    ai = &m[0];
    af = &m[8];
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j += 2) {
            e1 = 0x10000 * mf[i][j];
            e2 = 0x10000 * mf[i][j + 1];
            *(ai++) = (e1 & 0xFFFF0000) | ((e2 >> 16) & 0xFFFF);
            *(af++) = ((e1 << 16) & 0xFFFF0000) | (e2 & 0xFFFF);
        }
    }
}

void guLookAtF(Cpu* pCPU) {
    f32 len;
    f32 xAt;
    f32 yAt;
    f32 zAt;
    f32 xUp;
    f32 yUp;
    f32 zUp;
    f32 xEye;
    f32 yEye;
    f32 zEye;
    u32* mf;
    u32* sp;
    f32 xLook;
    f32 yLook;
    f32 zLook;
    f32 xRight;
    f32 yRight;
    f32 zRight;
    CpuFpr data;
    CpuFpr data0;
    CpuFpr data1;

    data0.f32 = 0.0f;
    data1.f32 = 1.0f;
    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[5].u32;
    xEye = data.f32;

    data.u32 = pCPU->aGPR[6].u32;
    yEye = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    zEye = data.f32;

    data.u32 = sp[4];
    xAt = data.f32;

    data.u32 = sp[5];
    yAt = data.f32;

    data.u32 = sp[6];
    zAt = data.f32;

    data.u32 = sp[7];
    xUp = data.f32;

    data.u32 = sp[8];
    yUp = data.f32;

    data.u32 = sp[9];
    zUp = data.f32;

    xLook = xAt - xEye;
    yLook = yAt - yEye;
    zLook = zAt - zEye;
    len = -1.0f / sqrtf(xLook * xLook + yLook * yLook + zLook * zLook);
    xLook *= len;
    yLook *= len;
    zLook *= len;

    xRight = yUp * zLook - zUp * yLook;
    yRight = zUp * xLook - xUp * zLook;
    zRight = xUp * yLook - yUp * xLook;
    len = 1.0f / sqrtf(xRight * xRight + yRight * yRight + zRight * zRight);
    xRight *= len;
    yRight *= len;
    zRight *= len;

    xUp = yLook * zRight - zLook * yRight;
    yUp = zLook * xRight - xLook * zRight;
    zUp = xLook * yRight - yLook * xRight;
    len = 1.0f / sqrtf(xUp * xUp + yUp * yUp + zUp * zUp);
    xUp *= len;
    yUp *= len;
    zUp *= len;

    data.f32 = xRight;
    mf[0 * 4 + 0] = data.u32;

    data.f32 = yRight;
    mf[1 * 4 + 0] = data.u32;

    data.f32 = zRight;
    mf[2 * 4 + 0] = data.u32;

    data.f32 = -(xEye * xRight + yEye * yRight + zEye * zRight);
    mf[3 * 4 + 0] = data.u32;

    data.f32 = xUp;
    mf[0 * 4 + 1] = data.u32;

    data.f32 = yUp;
    mf[1 * 4 + 1] = data.u32;

    data.f32 = zUp;
    mf[2 * 4 + 1] = data.u32;

    data.f32 = -(xEye * xUp + yEye * yUp + zEye * zUp);
    mf[3 * 4 + 1] = data.u32;

    data.f32 = xLook;
    mf[0 * 4 + 2] = data.u32;

    data.f32 = yLook;
    mf[1 * 4 + 2] = data.u32;

    data.f32 = zLook;
    mf[2 * 4 + 2] = data.u32;

    data.f32 = -(xEye * xLook + yEye * yLook + zEye * zLook);
    mf[3 * 4 + 2] = data.u32;

    mf[0 * 4 + 3] = data0.u32;
    mf[1 * 4 + 3] = data0.u32;
    mf[2 * 4 + 3] = data0.u32;
    mf[3 * 4 + 3] = data1.u32;
}

void guLookAt(Cpu* pCPU) {
    f32 mf[4][4];
    s32* m;
    u32* sp;
    CpuFpr data;
    s32 i;
    s32 j;
    s32 e1;
    s32 e2;
    s32* ai;
    s32* af;
    f32 len;
    f32 xLook;
    f32 yLook;
    f32 zLook;
    f32 xRight;
    f32 yRight;
    f32 zRight;
    f32 xEye;
    f32 yEye;
    f32 zEye;
    f32 xAt;
    f32 yAt;
    f32 zAt;
    f32 xUp;
    f32 yUp;
    f32 zUp;

    cpuGetAddressBuffer(pCPU, (void**)&m, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[5].u32;
    xEye = data.f32;

    data.u32 = pCPU->aGPR[6].u32;
    yEye = data.f32;

    data.u32 = pCPU->aGPR[7].u32;
    zEye = data.f32;

    data.u32 = sp[4];
    xAt = data.f32;

    data.u32 = sp[5];
    yAt = data.f32;

    data.u32 = sp[6];
    zAt = data.f32;

    data.u32 = sp[7];
    xUp = data.f32;

    data.u32 = sp[8];
    yUp = data.f32;

    data.u32 = sp[9];
    zUp = data.f32;

    xLook = xAt - xEye;
    yLook = yAt - yEye;
    zLook = zAt - zEye;
    len = -1.0f / sqrtf(xLook * xLook + yLook * yLook + zLook * zLook);
    xLook *= len;
    yLook *= len;
    zLook *= len;

    xRight = yUp * zLook - zUp * yLook;
    yRight = zUp * xLook - xUp * zLook;
    zRight = xUp * yLook - yUp * xLook;
    len = 1.0f / sqrtf(xRight * xRight + yRight * yRight + zRight * zRight);
    xRight *= len;
    yRight *= len;
    zRight *= len;

    xUp = yLook * zRight - zLook * yRight;
    yUp = zLook * xRight - xLook * zRight;
    zUp = xLook * yRight - yLook * xRight;
    len = 1.0f / sqrtf(xUp * xUp + yUp * yUp + zUp * zUp);
    xUp *= len;
    yUp *= len;
    zUp *= len;

    mf[0][0] = xRight;
    mf[1][0] = yRight;
    mf[2][0] = zRight;
    mf[3][0] = -(xEye * xRight + yEye * yRight + zEye * zRight);

    mf[0][1] = xUp;
    mf[1][1] = yUp;
    mf[2][1] = zUp;
    mf[3][1] = -(xEye * xUp + yEye * yUp + zEye * zUp);

    mf[0][2] = xLook;
    mf[1][2] = yLook;
    mf[2][2] = zLook;
    mf[3][2] = -(xEye * xLook + yEye * yLook + zEye * zLook);

    mf[0][3] = 0.0f;
    mf[1][3] = 0.0f;
    mf[2][3] = 0.0f;
    mf[3][3] = 1.0f;

    ai = &m[0];
    af = &m[8];
    for (i = 0; i < 4; i++) {
        for (j = 0; j < 4; j += 2) {
            e1 = 0x10000 * mf[i][j];
            e2 = 0x10000 * mf[i][j + 1];
            *(ai++) = (e1 & 0xFFFF0000) | ((e2 >> 16) & 0xFFFF);
            *(af++) = ((e1 << 16) & 0xFFFF0000) | (e2 & 0xFFFF);
        }
    }
}

typedef struct Light_t_s {
    /* 0x0 */ u8 col[3];
    /* 0x3 */ char pad1;
    /* 0x4 */ u8 colc[3];
    /* 0x7 */ char pad2;
    /* 0x8 */ s8 dir[3];
    /* 0xB */ char pad3;
} Light_t_s; // size = 0xC

typedef union Light_s {
    /* 0x0 */ Light_t_s l;
    /* 0x0 */ s64 force_structure_alignment[2];
} Light_s;

typedef struct LookAt_s {
    /* 0x0 */ Light_s l[2];
} LookAt_s; // size = 0x20

typedef struct Hilite_t_s {
    /* 0x0 */ s32 x1;
    /* 0x4 */ s32 y1;
    /* 0x8 */ s32 x2;
    /* 0xC */ s32 y2;
} Hilite_t_s; // size = 0x10

typedef union Hilite_s {
    /* 0x0 */ Hilite_t_s h;
    /* 0x0 */ s32 force_structure_alignment[4];
} Hilite_s;

#define MIN(a, b) ((a) < (b) ? (a) : (b))
#define FTOFRAC8(x) ((s32)MIN(((x) * (128.0f)), 127.0f) & 0xFF)

void guLookAtHiliteF(Cpu* pCPU) {
    LookAt_s* l;
    Hilite_s* h;
    CpuFpr data;
    u32* mf;
    u32* sp;
    f32 len;
    f32 xLook;
    f32 yLook;
    f32 zLook;
    f32 xRight;
    f32 yRight;
    f32 zRight;
    f32 xHilite;
    f32 yHilite;
    f32 zHilite;
    f32 xEye;
    f32 yEye;
    f32 zEye;
    f32 xAt;
    f32 yAt;
    f32 zAt;
    f32 xUp;
    f32 yUp;
    f32 zUp;
    f32 xl1;
    f32 yl1;
    f32 zl1;
    f32 xl2;
    f32 yl2;
    f32 zl2;
    s32 twidth;
    s32 theight;

    cpuGetAddressBuffer(pCPU, (void**)&mf, pCPU->aGPR[4].u32);
    cpuGetAddressBuffer(pCPU, (void**)&l, pCPU->aGPR[5].u32);
    cpuGetAddressBuffer(pCPU, (void**)&h, pCPU->aGPR[6].u32);
    cpuGetAddressBuffer(pCPU, (void**)&sp, pCPU->aGPR[29].u32);

    data.u32 = pCPU->aGPR[7].u32;
    xEye = data.f32;

    data.u32 = sp[4];
